Classes | Public Types | Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::DesignOptionCombinationViewSettings Class Reference
Design Options
A class that represents the design option combination settings of a view. More...
#include <DesignOptionCombinationViewSettings.hpp>
 Inheritance diagram for ACAPI::DesignOptions::DesignOptionCombinationViewSettings:
 Classes
struct  | Custom
A type of combination that the user has modified, but did not give an explicit name. More...
struct  | MainModelOnly
A type of combination that has no design option connected to it, and only shows the main model. More...
struct  | Missing
A type of combination that does not exist, and was previously deleted. More...
struct  | Standard
A type of combination for which the user has selected a specific set of design options. More...
 Public Types
 using  | Status = std::variant<MainModelOnly, Standard, Custom, Missing>
Status of the view settings.
 Public Member Functions
GS::UniString  | GetName () const
Result< Status >  | GetStatus () const
Result< void >  | SetMainModelOnly ()
Makes the connected view show only the main model.
Result< void >  | SetStandardCombination (const DesignOptionCombination &combination)
Makes the connected view show a selected design option combination.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::DesignOptionManagerImpl
 class  | DesignOptionManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option combination settings of a view.
Since
Archicad 27
Member Function Documentation
◆ GetName()
 GS::UniString ACAPI::DesignOptions::DesignOptionCombinationViewSettings::GetName  |  ( |   | ) |   const
Returns
The name of a design option combination view setting.
◆ GetStatus()
 Result< Status > ACAPI::DesignOptions::DesignOptionCombinationViewSettings::GetStatus  |  ( |   | ) |   const
Returns
The combination of the view setting.
Example code snippets from Test / Design Options
Get
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Status> status = settings->GetStatus ();
 if (status.IsErr ()) {
 continue;
 }
 const GS::UniString itemId (item.uiId);
 const GS::UniString itemIdPrefix = !itemId.IsEmpty () ? itemId + " " : GS::EmptyUniString;
 const GS::UniString itemName (item.uName);
 const GS::UniString fullName = itemIdPrefix + itemName;
 std::visit (
 GS::Overloaded {
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::MainModelOnly&) {
 WriteReport ("%s: Main Model Only.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Standard& standard) {
 WriteReport ("%s: %s.", fullName.ToCStr ().Get (), standard.combination.GetName ().ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Custom& /*custom*/) {
 WriteReport ("%s: Custom.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Missing&) {
 WriteReport ("%s: Missing.", fullName.ToCStr ().Get ());
 },
 },
 status.Unwrap ()
 );
 }
◆ SetMainModelOnly()
 Result< void > ACAPI::DesignOptions::DesignOptionCombinationViewSettings::SetMainModelOnly  |  ( |   | )
Makes the connected view show only the main model.
Example code snippets from Test / Design Options
Precondition
This function must be called from a command scope.
Returns
Whether the operation was successful.
 const ACAPI::Result<std::vector<API_NavigatorItem>> mapItems = GetLeafNavigatorItems (API_PublicViewMap);
 if (mapItems.IsErr ()) {
 WriteReport ("Failed to get navigator map items.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 ACAPI_CallUndoableCommand ("Undo Set Design Option Combinations To Main Model", [&] () -> GSErrCode {
 settings->SetMainModelOnly ();
 return NoError;
 });
 }
◆ SetStandardCombination()
 Result< void > ACAPI::DesignOptions::DesignOptionCombinationViewSettings::SetStandardCombination  |  ( |  const DesignOptionCombination & |  combination | )
Makes the connected view show a selected design option combination.
Returns
Whether the operation was successful.
Parameters
combination | The combination to be set.
The list of available combinations can be retrieved via DesignOptionManager::GetAvailableDesignOptionCombinations.
Precondition
This function must be called from a command scope.